import './style.scss';
import Link from 'next/link';
import Image from 'next/image';
export default function Footer() {
    type FooterItem = {
        name: string;
        list: {
            link?: string;
            text: string;
        }[];
    };

    const footerBottom: FooterItem[] = [
        {
            name: 'информация о юр. лице',
            list: [
                {
                    text: 'ОГРН 11111111111111111',
                },
                {
                    text: 'ИНН 2222222222222',
                },
                {
                    text: 'КПП 3333333333333',
                },
                {
                    text: 'ОКПО 44444444444 ОКВЭД 52.24',
                },
                {
                    text: 'ОКТМО 5555555555555',
                },
            ],
        },
        {
            name: 'Закупки',
            list: [
                {
                    text: 'Нормативные документы',
                    link: '#',
                },
                {
                    text: 'Закупки на VISMA Order',
                    link: '#',
                },
                {
                    text: 'Закупки на VISMA Tender',
                    link: '#',
                },
            ],
        },
        {
            name: 'акционерам',
            list: [
                {
                    text: 'Устав VISMA',
                    link: '#',
                },
                {
                    text: 'Свидетельства госрегистрации',
                    link: '#',
                },
                {
                    text: 'Список аффилированных лиц',
                    link: '#',
                },
                {
                    text: 'Информация',
                    link: '#',
                },
                {
                    text: 'Отчеты',
                    link: '#',
                },
            ],
        },
        {
            name: 'о компании',
            list: [
                {
                    text: 'Порт сегодня',
                    link: '#',
                },
                {
                    text: 'Характеристики порта',
                    link: '#',
                },
                {
                    text: 'История',
                    link: '#',
                },
                {
                    text: 'Дипломы и награды',
                    link: '#',
                },
                {
                    text: 'Транспортная безопасность',
                    link: '#',
                },
                {
                    text: 'Экология',
                    link: '#',
                },
                {
                    text: 'Правовая информация',
                    link: '#',
                },
            ],
        },
    ];
    return (
        <footer className='footer'>
            <div className='footer__top'>
                <div className='container'>
                    <div className='footer__top-inner'>
                        <Link href={'/'} className='footer__logo'>
                            <Image
                                src={'img/svg/f-logo.svg'}
                                alt=''
                                width={108}
                                height={30}
                            />
                        </Link>
                        <div className='footer__contacts'>
                            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                                <path d="M15 1.875C12.266 1.87823 9.6448 2.96575 7.71153 4.89902C5.77826 6.83229 4.69074 9.45344 4.68751 12.1875C4.68424 14.4218 5.41406 16.5954 6.76501 18.375C6.76501 18.375 7.04626 18.7453 7.0922 18.7987L15 28.125L22.9116 18.7941C22.9528 18.7444 23.235 18.375 23.235 18.375L23.2359 18.3722C24.5862 16.5934 25.3157 14.4207 25.3125 12.1875C25.3093 9.45344 24.2218 6.83229 22.2885 4.89902C20.3552 2.96575 17.7341 1.87823 15 1.875ZM15 15.9375C14.2583 15.9375 13.5333 15.7176 12.9166 15.3055C12.2999 14.8935 11.8193 14.3078 11.5355 13.6226C11.2516 12.9373 11.1774 12.1833 11.3221 11.4559C11.4668 10.7285 11.8239 10.0603 12.3484 9.53585C12.8728 9.0114 13.541 8.65425 14.2684 8.50955C14.9959 8.36486 15.7499 8.43912 16.4351 8.72295C17.1203 9.00678 17.706 9.48743 18.118 10.1041C18.5301 10.7208 18.75 11.4458 18.75 12.1875C18.7488 13.1817 18.3533 14.1348 17.6503 14.8378C16.9473 15.5408 15.9942 15.9363 15 15.9375Z" fill="white" />
                            </svg>
                            <b>123456, г. Тавима, ул. Морская, д. 21</b>
                        </div>
                        <div className='footer__group'>
                            <Link href={'tel:+71234566789'} className='footer__contacts'>
                                <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                                    <path d="M8.275 13.4875C10.075 17.025 12.975 19.9125 16.5125 21.725L19.2625 18.975C19.6 18.6375 20.1 18.525 20.5375 18.675C21.9375 19.1375 23.45 19.3875 25 19.3875C25.6875 19.3875 26.25 19.95 26.25 20.6375V25C26.25 25.6875 25.6875 26.25 25 26.25C13.2625 26.25 3.75 16.7375 3.75 5C3.75 4.3125 4.3125 3.75 5 3.75H9.375C10.0625 3.75 10.625 4.3125 10.625 5C10.625 6.5625 10.875 8.0625 11.3375 9.4625C11.475 9.9 11.375 10.3875 11.025 10.7375L8.275 13.4875Z" fill="white" />
                                </svg>
                                <b>+7 (123) 456-67-89</b>
                            </Link>
                            <Link href={'mailto:order@visma.ru'} className='footer__contacts'>
                                <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
                                    <path d="M25 5H5C3.625 5 2.5125 6.125 2.5125 7.5L2.5 22.5C2.5 23.875 3.625 25 5 25H25C26.375 25 27.5 23.875 27.5 22.5V7.5C27.5 6.125 26.375 5 25 5ZM24.5 10.3125L15.6625 15.8375C15.2625 16.0875 14.7375 16.0875 14.3375 15.8375L5.5 10.3125C5.37466 10.2421 5.2649 10.1471 5.17736 10.0331C5.08982 9.91906 5.02633 9.78847 4.99072 9.64921C4.95511 9.50995 4.94813 9.36492 4.9702 9.22288C4.99226 9.08085 5.04292 8.94477 5.1191 8.82288C5.19528 8.70099 5.29541 8.59582 5.41341 8.51374C5.53141 8.43167 5.66484 8.37439 5.80562 8.34537C5.9464 8.31636 6.0916 8.31621 6.23244 8.34494C6.37328 8.37366 6.50683 8.43067 6.625 8.5125L15 13.75L23.375 8.5125C23.4932 8.43067 23.6267 8.37366 23.7676 8.34494C23.9084 8.31621 24.0536 8.31636 24.1944 8.34537C24.3352 8.37439 24.4686 8.43167 24.5866 8.51374C24.7046 8.59582 24.8047 8.70099 24.8809 8.82288C24.9571 8.94477 25.0077 9.08085 25.0298 9.22288C25.0519 9.36492 25.0449 9.50995 25.0093 9.64921C24.9737 9.78847 24.9102 9.91906 24.8226 10.0331C24.7351 10.1471 24.6253 10.2421 24.5 10.3125Z" fill="white" />
                                </svg>
                                <b>order@visma.ru</b>
                            </Link>
                        </div>
                    </div>
                </div>
            </div>
            <div className='footer__bottom'>
                <div className='container'>
                    <div className='footer__bottom-inner'>
                        {footerBottom.map((item, index) => (
                            <div className='footer__bottom-item' key={index}>
                                <div className='footer__bottom-name'>
                                    <b>
                                        {item.name}
                                    </b>
                                </div>

                                <ul className='footer__menu'>
                                    {item.list.map((linkItem) => (
                                        <li className='footer__menu-item' key={linkItem.text}>
                                            {linkItem.link ? (
                                                <Link
                                                    href={linkItem.link}
                                                    className='footer__menu-link'
                                                >
                                                    {linkItem.text}
                                                </Link>
                                            ) : (
                                                linkItem.text
                                            )}
                                        </li>
                                    ))}
                                </ul>
                            </div>
                        ))}
                    </div>
                    <div className='footer__copy small-text'>
                        все права защищены АО VISMA
                    </div>
                </div>
            </div>
        </footer>
    )
}